#### ✅ Terraform Plan — `success`

<details><summary>Show plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_athena_workgroup.fraud will be created
  + resource "aws_athena_workgroup" "fraud" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "pwe-hackathon-pme-fraud"
      + state         = "ENABLED"
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "PySpark engine version 3"
            }

          + result_configuration {
              + output_location = (known after apply)
            }
        }
    }

  # aws_athena_workgroup.junior will be created
  + resource "aws_athena_workgroup" "junior" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "pwe-hackathon-pme-junior"
      + state         = "ENABLED"
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "PySpark engine version 3"
            }

          + result_configuration {
              + output_location = (known after apply)
            }
        }
    }

  # aws_athena_workgroup.marketing will be created
  + resource "aws_athena_workgroup" "marketing" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "pwe-hackathon-pme-marketing"
      + state         = "ENABLED"
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "PySpark engine version 3"
            }

          + result_configuration {
              + output_location = (known after apply)
            }
        }
    }

  # aws_iam_role.fraud_analyst will be created
  + resource "aws_iam_role" "fraud_analyst" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pwe-hackathon-fraud-analyst"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.junior_analyst will be created
  + resource "aws_iam_role" "junior_analyst" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pwe-hackathon-junior-analyst"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.marketing_analyst will be created
  + resource "aws_iam_role" "marketing_analyst" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pwe-hackathon-marketing-analyst"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.write_role will be created
  + resource "aws_iam_role" "write_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pwe-hackathon-write-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.fraud_analyst_kms will be created
  + resource "aws_iam_role_policy" "fraud_analyst_kms" {
      + id          = (known after apply)
      + name        = "kms-decrypt-all"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.fraud_analyst_s3 will be created
  + resource "aws_iam_role_policy" "fraud_analyst_s3" {
      + id          = (known after apply)
      + name        = "s3-read"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.junior_analyst_kms will be created
  + resource "aws_iam_role_policy" "junior_analyst_kms" {
      + id          = (known after apply)
      + name        = "kms-decrypt-footer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.junior_analyst_s3 will be created
  + resource "aws_iam_role_policy" "junior_analyst_s3" {
      + id          = (known after apply)
      + name        = "s3-read"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.marketing_analyst_kms will be created
  + resource "aws_iam_role_policy" "marketing_analyst_kms" {
      + id          = (known after apply)
      + name        = "kms-decrypt-footer-pii"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.marketing_analyst_s3 will be created
  + resource "aws_iam_role_policy" "marketing_analyst_s3" {
      + id          = (known after apply)
      + name        = "s3-read"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.write_role_kms will be created
  + resource "aws_iam_role_policy" "write_role_kms" {
      + id          = (known after apply)
      + name        = "kms-encrypt-all"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.write_role_s3 will be created
  + resource "aws_iam_role_policy" "write_role_s3" {
      + id          = (known after apply)
      + name        = "s3-read-write"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_kms_alias.footer will be created
  + resource "aws_kms_alias" "footer" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/pwe-hackathon-footer-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.pci will be created
  + resource "aws_kms_alias" "pci" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/pwe-hackathon-pci-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.pii will be created
  + resource "aws_kms_alias" "pii" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/pwe-hackathon-pii-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.footer will be created
  + resource "aws_kms_key" "footer" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "PME footer/schema encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                      + Resource  = "*"
                      + Sid       = "EnableRootAccountAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
    }

  # aws_kms_key.pci will be created
  + resource "aws_kms_key" "pci" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "PME PCI column encryption key (SSN, PAN, card_number)"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                      + Resource  = "*"
                      + Sid       = "EnableRootAccountAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
    }

  # aws_kms_key.pii will be created
  + resource "aws_kms_key" "pii" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "PME PII column encryption key (name, email, phone)"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::942136460468:root"
                        }
                      + Resource  = "*"
                      + Sid       = "EnableRootAccountAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
    }

  # aws_s3_bucket.data will be created
  + resource "aws_s3_bucket" "data" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "pwe-hackathon-pme-data-942136460468"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.data will be created
  + resource "aws_s3_bucket_public_access_block" "data" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.data will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "data" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "aws:kms"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.data will be created
  + resource "aws_s3_bucket_versioning" "data" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + athena_workgroup_fraud     = "pwe-hackathon-pme-fraud"
  + athena_workgroup_junior    = "pwe-hackathon-pme-junior"
  + athena_workgroup_marketing = "pwe-hackathon-pme-marketing"
  + data_bucket_arn            = (known after apply)
  + data_bucket_name           = (known after apply)
  + kms_footer_key_arn         = (known after apply)
  + kms_pci_key_arn            = (known after apply)
  + kms_pii_key_arn            = (known after apply)
  + role_fraud_analyst_arn     = (known after apply)
  + role_junior_analyst_arn    = (known after apply)
  + role_marketing_analyst_arn = (known after apply)
  + role_write_arn             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by @SiweiMa, Action: `pull_request`*